; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v8 - type_3 ?v2 - type_1)
 	      (pred_1 ?v6 - object ?v2 - type_1)
	      (pred_2 ?v8 - type_3 ?v3 - type_2)
	      (pred_4 ?v8 - type_3 ?v6 - object ?v3 - type_2))

   (:action op_1
       :parameters  (?v8 - type_3 ?v4 ?v7 - type_1)
       :precondition (and  (pred_3 ?v8 ?v4))
       :effect (and  (pred_3 ?v8 ?v7)
		     (not (pred_3 ?v8 ?v4))))

   (:action op_2
       :parameters (?v8 - type_3 ?v1 - object ?v5 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v5) (pred_3 ?v8 ?v5) (pred_2 ?v8 ?v3))
       :effect (and (pred_4 ?v8 ?v1 ?v3)
		    (not (pred_1 ?v1 ?v5)) 
		    (not (pred_2 ?v8 ?v3))))

   (:action op_3
       :parameters (?v8 - type_3 ?v1 - object ?v5 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_4 ?v8 ?v1 ?v3) (pred_3 ?v8 ?v5))
       :effect (and (pred_1 ?v1 ?v5)
		    (pred_2 ?v8 ?v3)
		    (not (pred_4 ?v8 ?v1 ?v3)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_05 - type_3
obj_02 obj_06 - type_2
obj_01 obj_09 obj_04 - type_1
obj_07 obj_08 obj_03 - object)
(:init
(pred_3 obj_05 obj_09)
(pred_2 obj_05 obj_02)
(pred_2 obj_05 obj_06)
(pred_1 obj_07 obj_09)
(pred_1 obj_08 obj_01)
(pred_1 obj_03 obj_04)
)
(:goal
(and
(pred_1 obj_07 obj_04)
(pred_1 obj_08 obj_04)
(pred_1 obj_03 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_05 ?b obj_06))))
)
)

; plan
1. (op_2 obj_05 obj_07 obj_09 obj_02)
   deleted: (pred_1 obj_07 obj_09) (pred_2 obj_05 obj_02)
   added: (pred_4 obj_05 obj_07 obj_02)
   goals met: 0 of 3
2. (op_1 obj_05 obj_09 obj_04)
   deleted: (pred_3 obj_05 obj_09)
   added: (pred_3 obj_05 obj_04)
   goals met: 0 of 3
3. (op_3 obj_05 obj_07 obj_04 obj_02)
   deleted: (pred_4 obj_05 obj_07 obj_02)
   added: (pred_1 obj_07 obj_04) (pred_2 obj_05 obj_02)
   goals met: 1 of 3
4. (op_2 obj_05 obj_03 obj_04 obj_02)
   deleted: (pred_1 obj_03 obj_04) (pred_2 obj_05 obj_02)
   added: (pred_4 obj_05 obj_03 obj_02)
   goals met: 1 of 3
5. (op_1 obj_05 obj_04 obj_09)
   deleted: (pred_3 obj_05 obj_04)
   added: (pred_3 obj_05 obj_09)
   goals met: 1 of 3
6. (op_3 obj_05 obj_03 obj_09 obj_02)
   deleted: (pred_4 obj_05 obj_03 obj_02)
   added: (pred_1 obj_03 obj_09) (pred_2 obj_05 obj_02)
   goals met: 2 of 3
7. (op_1 obj_05 obj_09 obj_01)
   deleted: (pred_3 obj_05 obj_09)
   added: (pred_3 obj_05 obj_01)
   goals met: 2 of 3
8. (op_2 obj_05 obj_08 obj_01 obj_02)
   deleted: (pred_1 obj_08 obj_01) (pred_2 obj_05 obj_02)
   added: (pred_4 obj_05 obj_08 obj_02)
   goals met: 2 of 3
9. (op_1 obj_05 obj_01 obj_04)
   deleted: (pred_3 obj_05 obj_01)
   added: (pred_3 obj_05 obj_04)
   goals met: 2 of 3
10. (op_3 obj_05 obj_08 obj_04 obj_02)
   deleted: (pred_4 obj_05 obj_08 obj_02)
   added: (pred_1 obj_08 obj_04) (pred_2 obj_05 obj_02)
   goals met: 3 of 3
